
/**
 * Created by Мария Криволуцкая
 *
 * Задача №7: Цикличный вывод данных на экран
 * Необходимо с помощью цикла вывести на экран числа от 1 до 50.
 */

public class Task_04 {
    public static void main(String[] args) {
        for (int i=1; i <= 50; i++) {
            System.out.print (i + " ");
        }
    }
}
